# Використовуємо офіційний образ Node.js як базовий
FROM node:20-alpine

# Встановлюємо робочу директорію в контейнері
WORKDIR /app

# Копіюємо package.json та package-lock.json (якщо є) для встановлення залежностей
# Це дозволяє Docker кешувати шар залежностей, що прискорює наступні збірки
COPY package*.json ./

# Встановлюємо залежності проекту
RUN npm install

# Копіюємо весь інший код у робочу директорію
COPY . .

# Відкриваємо порт, який використовує ваш додаток (3000 за замовчуванням у вашому коді)
EXPOSE 3000

# Запускаємо ваш додаток
CMD ["npm", "start"]